In [2]:
%load_ext sql

In [3]:
%sql sqlite:///C:\Users\bilene\Downloads\book.db

In [6]:
output = %sql SELECT * FROM topnames

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

In [7]:
type(output)

sql.run.ResultSet

In [8]:
import pandas as pd
df = pd.DataFrame(output)
df

     year     sex  name  count
0    1880  Female  Mary   7065
1    1880    Male  John   9655
2    1881  Female  Mary   6919
3    1881    Male  John   8769
4    1882  Female  Mary   8148
..    ...     ...   ...    ...
273  2016    Male  Noah  19117
274  2017  Female  Emma  19800
275  2017    Male  Liam  18798
276  2018  Female  Emma  18688
277  2018    Male  Liam  19837

[278 rows x 4 columns]

In [19]:
%%sql
output2 <<
SELECT * FROM indicators
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.
Returning data to local variable output2

In [20]:
pd.DataFrame(output2) # notice the output has only 5 rows stored

   year code   pop   gdp  life  cell  imports  exports
0  1960  ABW  0.05   NaN  65.7   0.0      NaN      NaN
1  1960  AFG  9.00  0.54  32.3   0.0      NaN     49.9
2  1960  AGO  5.45   NaN  33.3   0.0    127.5    123.3
3  1960  ALB  1.61   NaN  62.3   0.0      NaN      NaN
4  1960  AND  0.01   NaN   NaN   0.0      NaN      NaN

In [22]:
%%sql
-- Here is a one-line comment
/* Here is a multi-line comment
which continues here
and ends here */
SELECT * FROM indicators0

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('CHN', 1386.4, 12143.5, 76.4, 1469.88),
 ('FRA', 66.87, 2586.29, 82.5, 69.02),
 ('GBR', 66.06, 2637.87, 81.2, 79.1),
 ('IND', 1338.66, 2652.55, 68.8, 1168.9),
 ('USA', 325.15, 19485.4, 78.5, 391.6)]

In [24]:
%%sql
SELECT name FROM sqlite_master
WHERE type='table'

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('countries',), ('indicators',), ('indicators0',), ('topnames',)]

In [25]:
%%sql
--Explore tables
SELECT * FROM countries
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0),
 ('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0),
 ('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0)]

In [26]:
%%sql
--Explore tables
SELECT * FROM indicators
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1960, 'ABW', 0.05, None, 65.7, 0.0, None, None),
 (1960, 'AFG', 9.0, 0.54, 32.3, 0.0, None, 49.9),
 (1960, 'AGO', 5.45, None, 33.3, 0.0, 127.5, 123.3),
 (1960, 'ALB', 1.61, None, 62.3, 0.0, None, None),
 (1960, 'AND', 0.01, None, None, 0.0, None, None)]